# Exercise 1
# 1. Дано число (чотиризначне). Перевірити, чи воно є «щасливим квитком».
# Примітка: щасливим квитком називається число, у якому, при парній кількості цифр,
# сума цифр його лівої половини дорівнює сумі цифр його правої половини.
# Наприклад, 1322 є щасливим квитком, тому що 1 + 3 = 2 + 2.

value = list(map(int, input()))
first_part = value[:int(len(value) / 2)]
second_part = value[int(len(value) / 2):]
if sum(first_part) == sum(second_part):
    print(True)
else:
    print(False)

# Exersice 2
# З клавіатури вводиться число (шестизначне). Перевірити, чи воно є паліндромом.
# Примітка: Паліндром називається число, слово або текст, які однаково читаються зліва направо і справа наліво.
# Наприклад, це числа 143341, 5555, 7117 і т.д

palindrom = list(map(int, input()))
print(palindrom == palindrom[::-1])

# Exercise 3
# Дано коло з центром на початку координат та радіусом 4.
# Користувач вводить з клавіатури координати точки x та y.
# Написати програму, яка визначить, лежить ця точка всередині кола чи ні.

x, y = map(int, input().split())
radius = 4
d = x ** 2 + y ** 2

if d == radius ** 2:
    print("On")
elif d < radius ** 2:
    print("In")
else:
    print("Out")