#  1. Написати Python-скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні
number_all = []
for i in range(1, 100):
    if not i % 7:
        number_all.append(i)
print(number_all)

# 2. Написати Python-скрипт,
# який обчислює за допомогою циклу факторіал числа n (n вводиться з клавіатури)

number = int(input("Ex2. Factorial?")) + 1
fac = 1
for factorial in range(1, number):
    fac *= factorial
print(fac)


#  3. Написати Python-скрипт, який виводить на екран таблицю множення на 5.
#  Переважно друкувати 1 x 5 = 5, 2 x 5 = 10, а не просто 5, 10, ...

x = 11
y = 5
for i in range(x):
    print(f"{i} x {y} = {i * y}")

# 4. Написати Python-скрипт, який виводить на екран прямокутник із '*'.
# Висота і ширина прямокутника вводяться з клавіатури.
# Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5

a, b = int(input("Lenght=")), int(input("Weight="))
lenght = "*" * b
air = " "
print(f"{lenght}\n" + f"*{ air * (b - 2) }*\n" * (a - 2) + f"{lenght}")




# 5. Є список [0,5,2,4,7,1,3,19]. Написати Python-скрипт для підрахунку непарних цифр у ньому.
pair = [0, 5, 2, 4, 7, 1, 3, 19]
count = 0
for i in range(len(pair)):
    if pair[i] % 2:
        count += 1
print(count)


# # 6. Створіть список випадкових чисел (розміром 4 елементи). Створіть другий список у два рази більше першого,
# де перші 4 елементи повинні дорівнювати елементам першого списку, а решта елементів - подвоєним значенням початкових.
# # Наприклад,
# # Було → [1,4,7,2]
# # Стало → [1,4,7,2,2,8,14,4]

import random
b = [random.randint(1, 10), random.randint(1, 10), random.randint(1, 10), random.randint(1, 10)]
for i in range(len(b)):
    b.append(b[i] * 2)
print(b)

# 7. Створіть список із 12 елементів. Кожен елемент цього списку є зарплатою робітника за місяць.
# Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.

salary = [19099, 12312, 41231, 12312, 12312, 12312, 19312, 19421, 25812, 12397, 12464, 12573]
print(f'Загальна заробітна плата - {salary}, середня зарплата {sum(salary) / 12}')

# 8. Є матриця
# [1, 2, 3, 4]
# [5, 6, 7, 8]
# [9,10, 11, 12]
# [13,14, 15, 16]
# Напишіть Python-скрипт, який виведе цю матрицю на екран, обчислить та виведе суму елементів цієї матриці.

matrica = [[1, 2, 3, 4],
           [5, 6, 7, 8],
           [9, 10, 11, 12],
           [13, 14, 15, 16]]
pop = 0
for i in matrica:
    pop += sum(i)
    print(i)
print(pop)

# 9. Написати код для дзеркального перевороту списку [7,2,9,4] -> [4,9,2,7].

a = [7, 2, 9, 4]
a.reverse()
print(a)

# 10. За допомогою циклів вивести на екран усі прості числа від 1 до 100.

for i in range(2,101):
    for j in range(2, i):
        if not i % j:
            break
    else:
        print(i)

# 11. Виведіть на екран «пісочний годинник»,
# максимальна ширина якого зчитується з клавіатури (число непарне). У прикладі ширина дорівнює 5.
# *****
#  ***
#   *
#  ***
# *****

point = int(input("Hourglass"))
x = "*"
c = ""
res = []
while point > 0:
    res.append(f"{c}{x * point}\n")
    point -= 2
    c += " "
res += res[-2::-1]
print("".join(res))