# Exercise 1
# 1. Є дев'ятиповерховий будинок, в якому 4 під'їзди. Номер під'їзду починається з одиниці.
# На одному поверсі - 4 квартири. Напишіть програму, яка від користувача отримує номер квартири
# та виводить для заданої квартири номер під'їзду, поверху та номер на поверсі.
# Якщо такої квартира немає в цьому будинку, то необхідно повідомити користувача про це.

import math
room = int(input())
max = 144
pod = max < room > 0
print(pod and "Немає такої квартири!" or f"Номер під'їзду - {math.ceil(room / 36)}, "
                                         f"Номер поверху - {math.ceil(room % 36 / 4) or 1}  "
                                         f"Номер на поверсі - {int(room % 4) or 4}")


# Exercise 2
# Написати програму, яка буде повертати для заданого року кількість днів.
# Рік є високосним, якщо він кратний 4, але не кратний 100, а також якщо він кратний 400

year = int(input())
if not year % 400 or not year % 4 and year % 100:
    print("366")
else:
    print("Oops")


# Exercise 3
# Трикутник існує лише тоді, коли сума будь-яких двох сторін більше третьої.
# Дано: A, B, C - сторони трикутника. Напишіть програму, яка вказує чи існує такий трикутник.

a, b, c = map(int, input("Введіть дані трикутника - ").split())
print(a + b > c and b + c > a and c + a > b)

